---
type: FillPatternElement
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# FillPatternElement

`Autodesk.Revit.DB.FillPatternElement` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static FillPatternElement Create ( Document document , FillPattern fillPattern )` |
| Method | GetFillPattern | 2012 | `public FillPattern GetFillPattern ()` |
| Method | GetFillPatternElementByName | 2012 | `public static FillPatternElement GetFillPatternElementByName ( Document document , FillPatternTarget target , string name )` |
| Method | SetFillPattern | 2012 | `public void SetFillPattern ( FillPattern newFillPattern )` |
| Property | Parameter | — | `` |